### Pandas
- Pandas kütüphanesi veri analizi için kullanılan bir kütüphanedir.
- Panel data'dan gelmektedir.
- Yapısal verilerle çalışmak için kullanılır.
- Veri manipülasyonu ve analizi için yazılmış açık kaynaklı bir Python kütüphanesidir.
- Ekonometrik ve Finansal verilerle çalışmak için kullanılır.
- 2008 yılında Wes McKinney tarafından geliştirilmiştir.

pip install pandas komutu ile pandas kütüphanesini kurabiliriz.

### Pandas Serisi Oluşturma
pd.Series() ile pandas serisi oluşturabiliriz.

In [4]:
import pandas as pd
import numpy as np

seri = pd.Series([1,2,3,4,5,6,7,8,9]) #S harfi büyük olmalı yoksa hata alıyoruz.

In [5]:
print(seri)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

.axes ile serinin başlangıç, bitiş ve adım deerlerini görebiliriz.

In [6]:
print(seri.axes)

[RangeIndex(start=0, stop=9, step=1)]

In [7]:
print(seri.dtype)

int64

- .size ile serinin boyutunu görebiliriz.
- .ndim ile serinin boyut sayısını görebiliriz.
- .values ile serinin değerini görebiliriz.

In [9]:
print(seri.size)
print(seri.ndim)
print(seri.values)

9
1
[1 2 3 4 5 6 7 8 9]

- .head() ile serinin ilk 5 değerini görebiliriz. Eğer isterseniz .head(10) diyerek ilk 10 değeri görebiliriz.

In [10]:
seri.head() #Herhangi değer girmezsek ilk 5i yazdırır.

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [11]:
print(seri.head(3))

0    1
1    2
2    3
dtype: int64

- tail() ile serinin son 5 değerini görebiliriz. Eğer isterseniz .tail(10) diyerek son 10 değeri görebilirsiniz.

In [13]:
seri.tail()

4    5
5    6
6    7
7    8
8    9
dtype: int64

In [21]:
seri = pd.Series([99,22,332,94,5], index=["a", "b", "c", "d", "e"]) #Eğerki harf vermez isek direkt 0,1,2,3 diyerek numaralandırıyor.
print(seri)

a     99
b     22
c    332
d     94
e      5
dtype: int64

In [20]:
print(seri["a"])

99

In [22]:
print(seri["a" : "c"]) #Tırnak içerisinde yazmak zorundayız.

a     99
b     22
c    332
dtype: int64

In [24]:
sozluk = {"rog" : 10, "log" : 11, "cart" : 12}
seri = pd.Series(sozluk)
print(seri)   #Sözlük yapılarında bu tür bir çözüm yapılıyor.

rog     10
log     11
cart    12
dtype: int64

In [36]:
#Numpy ile kullanım 
randomNumbers = np.random.randint(10,100,5)
pandas = pd.Series(randomNumbers)
print(pandas[0])   #0.Elemanı yazdır demek istedik.
print(pandas)   #Random dediğimiz için her çalıştırmada farklı bir şey yazdırır.

52
0    52
1    26
2    86
3    52
4    32
dtype: int32

In [39]:
seri = pd.Series([200,121,150,99], index = ["a", "b", "c", "d"])
print(seri)

a    200
b    121
c    150
d     99
dtype: int64

In [41]:
seri.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [42]:
seri.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [43]:
print(list(seri.items()))

[('a', 200), ('b', 121), ('c', 150), ('d', 99)]

In [45]:
"a" in seri

False

In [46]:
"g" in seri

False

In [47]:
seri[["a","b"]]

a    200
b    121
dtype: int64

In [48]:
seri["a"] = 250
print(seri)

a    250
b    121
c    150
d     99
dtype: int64

### Pandas Dataframe Oluşturma
**pd.Dataframe()**
- DataFrame oluşturabiliriz.
- columns parametresi ile kolon isimlerini belirleyebiliriz.
- index parametresi ile index isimlerini belirleyebiliriz.

In [50]:
l = [1,2,3,4,5]
pd.DataFrame(l, columns = ["degisken_ismi"])

   degisken_ismi
0              1
1              2
2              3
3              4
4              5

In [52]:
m = np.arange(1,10).reshape((3,3))
pd.DataFrame(m, columns=["1","2","3"])

   1  2  3
0  1  2  3
1  4  5  6
2  7  8  9

In [53]:
df = pd.DataFrame(m, columns=["var1","var2","var3"])
df.head(2)

   var1  var2  var3
0     1     2     3
1     4     5     6

In [54]:
df.axes #start stop ve daha birçok bilgiyi veriyor.

[RangeIndex(start=0, stop=3, step=1),
 Index(['var1', 'var2', 'var3'], dtype='object')]

In [55]:
df.shape #Boyutunu verecek

(3, 3)

In [56]:
df.ndim

2

In [57]:
df.size

9

In [58]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [59]:
df.tail(1) #sondan elemanları görüyoruz.

   var1  var2  var3
2     7     8     9

### Eleman İşlemleri

In [24]:
import numpy as np
import pandas as pd
s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

In [4]:
pd.DataFrame(s1,s2,s3) #5 boyutluya 3 boyut verdiğimiz için hata aldık

ValueError: Shape of passed values is (5, 1), indices imply (5, 5)

In [25]:
import pandas as pd
sozluk = {"var1" : s1, "var2" : s2, "var3" : s3}
df = pd.DataFrame(sozluk)

In [26]:
df

   var1  var2  var3
0     4     0     2
1     2     7     8
2     4     2     7
3     2     4     3
4     2     1     7

In [7]:
df[0:1]

   var1  var2  var3
0     0     2     3

In [27]:
df.index = ["a","b","c","d","e"]

In [16]:
df

   var1  var2  var3
a     0     2     3
b     5     2     3
c     4     3     0
d     5     9     9
e     1     5     6

In [17]:
df[0:1]

   var1  var2  var3
a     0     2     3

In [18]:
df["c":"e"]

   var1  var2  var3
c     4     3     0
d     5     9     9
e     1     5     6

- df.drop() ile kolon veya satır silme işlemi yapabiliriz.
- axis = 1 ile kolon silme işlemi yapabiliriz.
- axis = 0 ile satır silme işlemi yapabiliriz.

In [8]:
df.drop("a",axis=0)

   var1  var2  var3
b     5     1     8
c     7     8     3
d     8     4     5
e     7     9     2

In [9]:
df       #axis kullanmamız satırı veya sütunu kalıcı olarak silmez(Bir önceki kodda kullandığımız)

   var1  var2  var3
a     7     8     8
b     5     1     8
c     7     8     3
d     8     4     5
e     7     9     2

In [10]:
df.drop("a",axis=0,inplace=True)

In [11]:
df

   var1  var2  var3
b     5     1     8
c     7     8     3
d     8     4     5
e     7     9     2

In [12]:
l ={"var1","var2","var3"}
for i in l:
    print(i in l)

True
True
True

In [28]:
df["var4"] = df["var1"] / df["var2"]
df

   var1  var2  var3      var4
a     4     0     2       inf
b     2     7     8  0.285714
c     4     2     7  2.000000
d     2     4     3  0.500000
e     2     1     7  2.000000

In [9]:
df.drop("var4",axis=1,inplace=True)
df

   var1  var2  var3
a     6     4     2
b     7     0     6
c     6     7     8
d     8     0     8
e     8     5     2

In [10]:
l = ["var1","var2"]
df.drop(l,axis=1)

   var3
a     2
b     6
c     8
d     8
e     2

### Gözlem ve Değişken Seçimi

In [29]:
m = np.random.randint(1,30,size=(10,3))
df = pd.DataFrame(m,columns= ["var1","var2","var3"])
df

   var1  var2  var3
0     9     5     4
1     8    27     8
2     9    14    22
3    17    15    23
4    25    13    19
5    28    10    28
6    23     8     9
7    13     9    29
8    22    17     1
9     4     6    16

### loc
- Tanımlandığı şekliyle seçim yapmak için kullanılır.

In [12]:
df.loc[0:3]

   var1  var2  var3
0     9    18     4
1     2    23    21
2     5    15    11
3    10    16    22

### iloc
- Alışık olduğumuz indexleme mantığıyla seçim yapmak için kullanılır.

In [13]:
df.iloc[0:3]

   var1  var2  var3
0     9    18     4
1     2    23    21
2     5    15    11

In [14]:
df.iloc[0,0]

9

In [15]:
df.iloc[:3, :2]

   var1  var2
0     9    18
1     2    23
2     5    15

In [17]:
df.loc[0:3,"var3"] #loc sondaki veriye kadar bakarken iloc sondan bir öceki veriye bakıyor.

0     4
1    21
2    11
3    22
Name: var3, dtype: int32

In [18]:
df.iloc[0:3,0:2]

   var1  var2
0     9    18
1     2    23
2     5    15

### Koşullu Eleman İşlemleri

In [34]:
df[df.var1>15]

   var1  var2  var3
3    17    15    23
4    25    13    19
5    28    10    28
6    23     8     9
8    22    17     1

In [33]:
df[df.var1%2==0]

   var1  var2  var3
1     8    27     8
5    28    10    28
8    22    17     1
9     4     6    16

In [31]:
df.loc[(df.var1 > 15) & (df.var3 < 15), "var2"]

6     8
8    17
Name: var2, dtype: int32

In [30]:
df.query("var1 > 15 & var3 < 15")

   var1  var2  var3
6    23     8     9
8    22    17     1

### Birleştirme (Join) İşlemleri

In [53]:
df2 = df + 99
df2

   var1  var2  var3
0   108   104   103
1   107   126   107
2   108   113   121
3   116   114   122
4   124   112   118
5   127   109   127
6   122   107   108
7   112   108   128
8   121   116   100
9   103   105   115

**.concat** fonksiyonu ile iki dataframe'i birleştirebiliriz. ignore_index parametresi ile indexleri sıfırlayabiliriz.
* join parametresi ile hangi kolon üzerinden birleştirileceğini belirleyebiliriz.

In [52]:
pd.concat([df,df2])

   var1  var2  var3 Çalışanlar  İlk Giriş Yılı
0   9.0   5.0   4.0        NaN             NaN
1   8.0  27.0   8.0        NaN             NaN
2   9.0  14.0  22.0        NaN             NaN
3  17.0  15.0  23.0        NaN             NaN
4  25.0  13.0  19.0        NaN             NaN
5  28.0  10.0  28.0        NaN             NaN
6  23.0   8.0   9.0        NaN             NaN
7  13.0   9.0  29.0        NaN             NaN
8  22.0  17.0   1.0        NaN             NaN
9   4.0   6.0  16.0        NaN             NaN
0   NaN   NaN   NaN      Ahmet          2021.0
1   NaN   NaN   NaN    Emirhan          2019.0
2   NaN   NaN   NaN    Berkcan          2022.0
3   NaN   NaN   NaN      Eslem          2018.0

In [37]:
pd.concat([df,df2], ignore_index=True)

    var1  var2  var3
0      9     5     4
1      8    27     8
2      9    14    22
3     17    15    23
4     25    13    19
5     28    10    28
6     23     8     9
7     13     9    29
8     22    17     1
9      4     6    16
10   108   104   103
11   107   126   107
12   108   113   121
13   116   114   122
14   124   112   118
15   127   109   127
16   122   107   108
17   112   108   128
18   121   116   100
19   103   105   115

In [54]:
df2.columns = ["var1","var2","var3"]
pd.concat([df,df2],join="inner")

   var1  var2  var3
0     9     5     4
1     8    27     8
2     9    14    22
3    17    15    23
4    25    13    19
5    28    10    28
6    23     8     9
7    13     9    29
8    22    17     1
9     4     6    16
0   108   104   103
1   107   126   107
2   108   113   121
3   116   114   122
4   124   112   118
5   127   109   127
6   122   107   108
7   112   108   128
8   121   116   100
9   103   105   115

### İleri Birleştirme İşlemleri

In [50]:
df1 = pd.DataFrame({"Çalışanlar":["Ahmet","Emirhan","Berkcan","Eslem"],
                                   "Grup": ["Koordinatör","Full Time Çalışan","Eğitim Koordinatörü","İş Geliştirme"]})
df1

  Çalışanlar                 Grup
0      Ahmet          Koordinatör
1    Emirhan    Full Time Çalışan
2    Berkcan  Eğitim Koordinatörü
3      Eslem        İş Geliştirme

In [59]:
df2 = pd.DataFrame({"Çalışanlar":["Ahmet","Emirhan","Berkcan","Eslem"],
                    "İlk Giriş Yılı" :[2021,2019,2022,2018]})
df2

  Çalışanlar  İlk Giriş Yılı
0      Ahmet            2021
1    Emirhan            2019
2    Berkcan            2022
3      Eslem            2018

### .merge()
- .merge() fonksiyonu ile birebir birleştirme işlemlerini gerçekleştirebiliriz.
- Merge komutu ile yapılan işlemleri SQL'de bulunan inner join ...'e benzetebiliriz.

In [60]:
pd.merge(df1,df2) #2 çıktıyıda görmemizi sağlar.

  Çalışanlar                 Grup  İlk Giriş Yılı
0      Ahmet          Koordinatör            2021
1    Emirhan    Full Time Çalışan            2019
2    Berkcan  Eğitim Koordinatörü            2022
3      Eslem        İş Geliştirme            2018

In [61]:
pd.merge(df1,df2,on = "Çalışanlar")

  Çalışanlar                 Grup  İlk Giriş Yılı
0      Ahmet          Koordinatör            2021
1    Emirhan    Full Time Çalışan            2019
2    Berkcan  Eğitim Koordinatörü            2022
3      Eslem        İş Geliştirme            2018